# WidthDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPartSizeMap..::..WidthDiameter Property
FabricationPartSizeMap Class See Also
---
The width or diameter of the straight.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public double WidthDiameter { get; set; }
```

Visual Basic
---
```text
Public Property WidthDiameter As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double WidthDiameter {
	double get ();
	void set (double value);
}
```

# See Also
FabricationPartSizeMap Class
Autodesk.Revit.DB.Fabrication Namespace